system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin -1;
xmax 6;
ymin -1;
ymax 1;
zmin -1;
zmax 6;

xcells 50;
ycells 50;
zcells 50;

// dx 0.05;
// dy 0.05;
// dz 0.05;

// lx #calc "$xmax - $xmin";
// ly #calc "$ymax - $ymin";
// lz #calc "$zmax - $zmin";

// xcells #calc "round(($lx)/($dx))";
// ycells #calc "round(($ly)/($dy))";
// zcells #calc "round(($lz)/($dz))";

vertices
(
    ($xmin $ymin $zmin) //0
    ($xmax $ymin $zmin) //1
    ($xmax $ymax $zmin) //2
    ($xmin $ymax $zmin) //3
    ($xmin $ymin $zmax) //4
    ($xmax $ymin $zmax) //5
    ($xmax $ymax $zmax) //6
    ($xmin $ymax $zmax) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);

edges
(
);

patches         
(
    patch minX
    (
        (0 4 7 3)
    )
    patch maxX
    (
        (2 6 5 1)
    )
    patch minY
    (
        (1 5 4 0)
    )
    patch maxY 
    (
        (3 7 6 2)
    )
    patch minZ
    (
        (0 3 2 1)
    )
    patch maxZ
    (
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //

