system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    pipeAll.stl
    {
        type triSurfaceMesh;
        name pipeVolume; 

// First entry in named region in the STL file
// Second entry is user-defined patch name
        regions
        {
            inlet1 {name inlet1Patch;}
            inlet2 {name inlet2Patch;}
            outlet {name outletPatch;}
            pipe {name pipeWall;}
        }
    }

};

// Settings for the castellatedMesh generation.
castellatedMeshControls
{
    // Refinement parameters
    maxLocalCells 				100000;
    maxGlobalCells 				20000000;
    minRefinementCells 			10;
    maxLoadUnbalance 			0.10;
    nCellsBetweenLevels 		2;
    allowFreeStandingZoneFaces 	true;
    resolveFeatureAngle 		30;		
    planarAngle 				30;


    // Explicit feature edge refinement
    // Force snap to the sharp angles
    features
    (
        { file "pipeAll.eMesh"; level 0; }
    );

    // Surface based refinement
    refinementSurfaces
    {
        pipeVolume
        {
            // Global surface-wise min and max refinement level
            level (0 0);

            // Local surface-wise min and max refinement level
			// You will need to use the name given in the STL file
            regions
			{
            	inlet1				//inlet1Patch 
                { level (1 1); patchInfo { type patch; } }

            	inlet2				//inlet2Patch 
                { level (1 1); patchInfo { type patch; } }

            	outlet				//outletPatch
                { level (1 1); patchInfo { type patch; } }

                // refine cells near wall
            	pipe	            //pipeWall could use "(patch1|patch2)" wildcard
                { level (2 2); patchInfo { type wall; } }
			}
        }
    }


    // Region-wise refinement
    refinementRegions
    {
        pipeVolume
        {
            mode distance;		//distance, inside, outside
            levels ((1e-4 0));
        }
    }


    // Mesh selection
    // Important: This is a point inside the volume you want to mesh!
    locationInMesh (1 0 0.5); 

}

// Settings for the snapping.
// Wolf says these are reliable...should leave them alone
snapControls
{
    nSmoothPatch 	3;
    tolerance 		2.0;
    nSolveIter 		100;
    nRelaxIter 		5;

    // Feature snapping
	nFeatureSnapIter 10;

	implicitFeatureSnap false;
	explicitFeatureSnap true;

	// Detect features between multiple surfaces
	// (only for explicitFeatureSnap, default = false)
	multiRegionFeatureSnap false;
}

// Settings for the layer addition.
addLayersControls
{
    relativeSizes 		true;
	expansionRatio 		1.2;
	finalLayerThickness 0.5; //percentage of background mesh when relativeSizes is true
	minThickness 		0.01;

    layers
    {
        pipeWall { nSurfaceLayers 5; }
    }


    // Advanced settings
    featureAngle 				130;	
    slipFeatureAngle 			30;

    nGrow 						0;

    nLayerIter 					50;
    nRelaxedIter 				20;
    nRelaxIter 					5;

    nSmoothSurfaceNormals 		1;
    nSmoothNormals 				3;
    nSmoothThickness 			10;
    maxFaceThicknessRatio 		0.5;
    maxThicknessToMedialRatio 	0.3;

    minMedialAxisAngle 			90;
    minMedianAxisAngle 			90;
    nMedialAxisIter           	10;

    nBufferCellsNoExtrude 		0;
    additionalReporting 		false;
}

// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"

    relaxed
    {
        maxNonOrtho 75;
    }

    //minFlatness 0.5;

    // Advanced
    nSmoothScale 4;
    errorReduction 0.75;
}

// Advanced
debug 0;

//// Debug flags
debugFlags
(
    //mesh            // write intermediate meshes
    //intersections   // write current mesh intersections as .obj files
    //featureSeeds    // write information about explicit feature edge refinement
    //attraction      // write attraction as .obj files
    //layerInfo       // write information about layers
);

//// Write flags
writeFlags
(
    //scalarLevels    // write volScalarField with cellLevel for postprocessing
    //layerSets       // write cellSets, faceSets of faces in layer
    //layerFields     // write volScalarField for layer coverage
);

// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;

// ************************************************************************* //
